Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/documenting.tmx
Source language: en
Languages: pl

source: Many special names are used in the Python documentation, including the names of operating systems, programming languages, standards bodies, and the like. Most of these entities are not assigned any special markup, but the preferred spellings are given here to aid authors in maintaining the consistency of presentation in the Python documentation.
pl: Wiele specjalnych nazw jest używanych w dokumentacji języka pytonowskiego, włączając w to nazwy systemów operacyjnych, języków programowania, korpusy standardów itp. Większość z tych elementów nie jest oznaczona żadnymi specjalnymi adnotacjami, ale preferowane literowania dane są tu aby pomóc autorom w utrzymywaniu spójności prezentacji w dokumentacji języka pytonowskiego.

source: Other terms and words deserve special mention as well; these conventions should be used to ensure consistency throughout the documentation:
pl: Inne terminy i słowa zasługują na wspomnienie także; te konwencje powinny być używane aby zapewnić spójność w całej dokumentacji:

source: For "central processing unit." Many style guides say this should be spelled out on the first use (and if you must use it, do so!). For the Python documentation, this abbreviation should be avoided since there's no reasonable way to predict which occurrence will be the first seen by the reader. It is better to use the word "processor" instead.
pl: Dla "centralnego elementu przetwarzania." ( - z ang. w skrócie - cpu - "central processing unit.") Wiele przewodników stylu mówi że to powinno być wymienione przy pierwszym użyciu (i jeśli musisz tego używać, rób to!). Dla dokumentacji języka pytonowskiego ten skrót powinien być omijany gdyż nie ma rozsądnego sposobu aby przewidzieć które wystąpienie będzie pierwszym widzianym przez czytającego. Lepiej jest użyć słowa "procesor" zamiast tego.

source: The name assigned to a particular group of standards. This is always uppercase.
pl: Nazwa przydzielona szczególnej grupie standardów. To jest zawsze dużymi literami.

source: The name of our favorite programming language is always capitalized.
pl: Nazwa naszego ulubionego języka programowania jest zawsze z dużej litery.

source: The name of a character set and matching encoding. This is always written capitalized.
pl: Nazwa zbioru znaków i pasującego kodowania. To zawsze piszemy z dużej litery.

source: The name of the operating system developed at AT&T Bell Labs in the early 1970s.
pl: Nazwa systemu operacyjnego wymyślonego w AT&T laboratoriach Bell'a we wczesnych latach 1970-tych.
